import Image from 'next/image'
import { FC } from 'react'

import Layout from '@/components/layout/Layout'

import styles from './OurStory.module.scss'

const OurStory: FC = () => {
	return (
		<Layout title={'Наша історія'}>
			<div className={styles.head}>
				<h3>
					<span>Чікенбрест</span>
				</h3>
				<h2>
					<span>НАША ІСТОРІЯ</span>
				</h2>
			</div>
			<div className={styles.boxes}>
				<div>
					<div className={styles.textBlock}>
						<h3>
							<span>Трохи Більше</span>
						</h3>
						<h2>
							<span>Про Нас</span>
						</h2>
						<p>
							<span>
								Вирощування натуральної курки є нашою пристрастю вже понад 40
								років! Ми належимо сім’ї і завжди були такими, починаючи з 1974
								року, коли ми перейшли з вирощування індиків на розведення
								курей. За десятиліття ми виросли, але ми все ще зберігаємо
								практичний підхід і сімейні цінності, якими ми відомі. Ми
								ретельно контролюємо кожен крок, починаючи від виробництва яєць
								і закінчуючи інкубаційним цехом і закінчуючи переробним
								підприємством, завдяки чому птахофабрика Чікенбрест справді
								працює «від яєць до столу».
							</span>
						</p>
					</div>
				</div>
				<div>
					<div className={styles.farm}>
						<Image
							width={600}
							height={400}
							src={
								'data:image/svg+xml,%3Csvg%20xmlns%3D%27http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%27%20width%3D%27600%27%20height%3D%27400%27%20viewBox%3D%270%200%20600%20400%27%3E%3Crect%20width%3D%27600%27%20height%3D%27400%27%20fill-opacity%3D%220%22%2F%3E%3C%2Fsvg%3E'
							}
							alt={'background'}
						/>
					</div>
				</div>
				<div>
					<div className={styles.farmer}>
						<Image
							width={600}
							height={400}
							src={
								'data:image/svg+xml,%3Csvg%20xmlns%3D%27http%3A%2F%2Fwww.w3.org%2F2000%2Fsvg%27%20width%3D%27600%27%20height%3D%27400%27%20viewBox%3D%270%200%20600%20400%27%3E%3Crect%20width%3D%27600%27%20height%3D%27400%27%20fill-opacity%3D%220%22%2F%3E%3C%2Fsvg%3E'
							}
							alt={'background'}
						/>
					</div>
				</div>
				<div>
					<div className={styles.textBlock}>
						<h3>
							<span>Усім Шановним Клієнтам</span>
						</h3>
						<p className={styles.mt}>
							<span>
								Наші курчата виводяться, вирощуються та обробляються в районі
								Північної Індіани, Південного Мічигану. Наших домашніх курчат
								годують кукурудзяним і соєвим раціоном без антибіотиків, без
								штучних інгредієнтів чи барвників, без гормонів, який
								виробляється на нашому власному комбікормовому заводі в
								Нью-Парісі, Індіана. Наші ферми розташовані в меншій
								регіональній зоні, розташованій у кілометрах від нашого
								переробного заводу, тому наш вуглецевий слід мінімізований.
								<br />
								<br />
								Те, що ми обробляємо сьогодні, часто буде у вашому магазині
								завтра. Наша мета — надати вам найсвіжішу та найздоровішу курку.
								Ми наполегливо працюємо, щоб виробляти найкраще м’ясо птиці на
								сьогоднішньому ринку, і сподіваємося, що ви, ваша сім’я та друзі
								будете часто ним насолоджуватися.
								<br />
								<br />– <em>Олександр Бойко</em>
							</span>
						</p>
					</div>
				</div>
			</div>
			<div className={styles.history}>
				<div>
					<h2>
						<span>Історія</span>
					</h2>
					<div>
						<div className={styles.side}></div>
						<div className={styles.center}>
							<p>
								<span>
									Наша материнська компанія Chicken Manor, Inc. була заснована в
									1942 році, коли Михайло та Володимир Бойко придбали
									висококласну молочну ферму Chicken Manor Farms. У 1947 році
									компанія Chicken Manor Farms почала виводити, вирощувати та
									переробляти індиків, а в 1974 році перейшла до вирощування
									курчат-бройлерів і самостійного виведення курчат та змінила
									назву на Чікенбрест. У 1992 році Чікенбрест придбала завод з
									переробки птиці Booth в Орланді, Індіана, а також власний
									комбікормовий завод у Нью-Парісі, Індіана та у Хмельницькому,
									Україна. Незабаром після цього було проведено значну
									реконструкцію комбікормового заводу, що підвищило якість корму
									для курчат. У 2000 році на переробному заводі почалася перша
									капітальна реконструкція з встановленням нової автоматизованої
									системи зважування та нарізки. Відтоді Чікенбрест інвестувала
									мільйони доларів у підтримку та розширення свого сучасного
									переробного підприємства, останнє розширення площею 100 000
									квадратних футів було завершено у 2020 році. У 2021 році
									Чікенбрест перейшло на виробництво 100% повітряно-охолодженої
									курки. Ці доповнення для оновлення обладнання та технологій
									переробного заводу продовжують забезпечувати нашим клієнтам
									найвищу якість, чисту та натуральну курку, яку ми можемо
									виробляти.
								</span>
							</p>
						</div>
						<div className={styles.side}></div>
					</div>
				</div>
			</div>
		</Layout>
	)
}

export default OurStory
